###################################################################

# Created by write_sdc on Sat Apr  9 21:19:24 2022

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports rstn]
set_driving_cell -lib_cell INVX1TS [get_ports fire]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_w[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {in_a[0]}]
set_load -pin_load 0.005 [get_ports out_f]
set_load -pin_load 0.005 [get_ports {out_a[7]}]
set_load -pin_load 0.005 [get_ports {out_a[6]}]
set_load -pin_load 0.005 [get_ports {out_a[5]}]
set_load -pin_load 0.005 [get_ports {out_a[4]}]
set_load -pin_load 0.005 [get_ports {out_a[3]}]
set_load -pin_load 0.005 [get_ports {out_a[2]}]
set_load -pin_load 0.005 [get_ports {out_a[1]}]
set_load -pin_load 0.005 [get_ports {out_a[0]}]
set_load -pin_load 0.005 [get_ports {out_w[7]}]
set_load -pin_load 0.005 [get_ports {out_w[6]}]
set_load -pin_load 0.005 [get_ports {out_w[5]}]
set_load -pin_load 0.005 [get_ports {out_w[4]}]
set_load -pin_load 0.005 [get_ports {out_w[3]}]
set_load -pin_load 0.005 [get_ports {out_w[2]}]
set_load -pin_load 0.005 [get_ports {out_w[1]}]
set_load -pin_load 0.005 [get_ports {out_w[0]}]
set_load -pin_load 0.005 [get_ports {out0[31]}]
set_load -pin_load 0.005 [get_ports {out0[30]}]
set_load -pin_load 0.005 [get_ports {out0[29]}]
set_load -pin_load 0.005 [get_ports {out0[28]}]
set_load -pin_load 0.005 [get_ports {out0[27]}]
set_load -pin_load 0.005 [get_ports {out0[26]}]
set_load -pin_load 0.005 [get_ports {out0[25]}]
set_load -pin_load 0.005 [get_ports {out0[24]}]
set_load -pin_load 0.005 [get_ports {out0[23]}]
set_load -pin_load 0.005 [get_ports {out0[22]}]
set_load -pin_load 0.005 [get_ports {out0[21]}]
set_load -pin_load 0.005 [get_ports {out0[20]}]
set_load -pin_load 0.005 [get_ports {out0[19]}]
set_load -pin_load 0.005 [get_ports {out0[18]}]
set_load -pin_load 0.005 [get_ports {out0[17]}]
set_load -pin_load 0.005 [get_ports {out0[16]}]
set_load -pin_load 0.005 [get_ports {out0[15]}]
set_load -pin_load 0.005 [get_ports {out0[14]}]
set_load -pin_load 0.005 [get_ports {out0[13]}]
set_load -pin_load 0.005 [get_ports {out0[12]}]
set_load -pin_load 0.005 [get_ports {out0[11]}]
set_load -pin_load 0.005 [get_ports {out0[10]}]
set_load -pin_load 0.005 [get_ports {out0[9]}]
set_load -pin_load 0.005 [get_ports {out0[8]}]
set_load -pin_load 0.005 [get_ports {out0[7]}]
set_load -pin_load 0.005 [get_ports {out0[6]}]
set_load -pin_load 0.005 [get_ports {out0[5]}]
set_load -pin_load 0.005 [get_ports {out0[4]}]
set_load -pin_load 0.005 [get_ports {out0[3]}]
set_load -pin_load 0.005 [get_ports {out0[2]}]
set_load -pin_load 0.005 [get_ports {out0[1]}]
set_load -pin_load 0.005 [get_ports {out0[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rstn]
set_max_capacitance 0.005 [get_ports fire]
set_max_capacitance 0.005 [get_ports {in_w[7]}]
set_max_capacitance 0.005 [get_ports {in_w[6]}]
set_max_capacitance 0.005 [get_ports {in_w[5]}]
set_max_capacitance 0.005 [get_ports {in_w[4]}]
set_max_capacitance 0.005 [get_ports {in_w[3]}]
set_max_capacitance 0.005 [get_ports {in_w[2]}]
set_max_capacitance 0.005 [get_ports {in_w[1]}]
set_max_capacitance 0.005 [get_ports {in_w[0]}]
set_max_capacitance 0.005 [get_ports {in_a[7]}]
set_max_capacitance 0.005 [get_ports {in_a[6]}]
set_max_capacitance 0.005 [get_ports {in_a[5]}]
set_max_capacitance 0.005 [get_ports {in_a[4]}]
set_max_capacitance 0.005 [get_ports {in_a[3]}]
set_max_capacitance 0.005 [get_ports {in_a[2]}]
set_max_capacitance 0.005 [get_ports {in_a[1]}]
set_max_capacitance 0.005 [get_ports {in_a[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rstn]
set_max_fanout 4 [get_ports fire]
set_max_fanout 4 [get_ports {in_w[7]}]
set_max_fanout 4 [get_ports {in_w[6]}]
set_max_fanout 4 [get_ports {in_w[5]}]
set_max_fanout 4 [get_ports {in_w[4]}]
set_max_fanout 4 [get_ports {in_w[3]}]
set_max_fanout 4 [get_ports {in_w[2]}]
set_max_fanout 4 [get_ports {in_w[1]}]
set_max_fanout 4 [get_ports {in_w[0]}]
set_max_fanout 4 [get_ports {in_a[7]}]
set_max_fanout 4 [get_ports {in_a[6]}]
set_max_fanout 4 [get_ports {in_a[5]}]
set_max_fanout 4 [get_ports {in_a[4]}]
set_max_fanout 4 [get_ports {in_a[3]}]
set_max_fanout 4 [get_ports {in_a[2]}]
set_max_fanout 4 [get_ports {in_a[1]}]
set_max_fanout 4 [get_ports {in_a[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_uncertainty 0.01  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports rstn]
set_input_delay -clock clk  0.1  [get_ports fire]
set_input_delay -clock clk  0.1  [get_ports {in_w[7]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[6]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[5]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[4]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[3]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[2]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[1]}]
set_input_delay -clock clk  0.1  [get_ports {in_w[0]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[7]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[6]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[5]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[4]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[3]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[2]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[1]}]
set_input_delay -clock clk  0.1  [get_ports {in_a[0]}]
set_output_delay -clock clk  0.1  [get_ports out_f]
set_output_delay -clock clk  0.1  [get_ports {out_a[7]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[6]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[5]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[4]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[3]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[2]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[1]}]
set_output_delay -clock clk  0.1  [get_ports {out_a[0]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[7]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[6]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[5]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[4]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[3]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[2]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[1]}]
set_output_delay -clock clk  0.1  [get_ports {out_w[0]}]
set_output_delay -clock clk  0.1  [get_ports {out0[31]}]
set_output_delay -clock clk  0.1  [get_ports {out0[30]}]
set_output_delay -clock clk  0.1  [get_ports {out0[29]}]
set_output_delay -clock clk  0.1  [get_ports {out0[28]}]
set_output_delay -clock clk  0.1  [get_ports {out0[27]}]
set_output_delay -clock clk  0.1  [get_ports {out0[26]}]
set_output_delay -clock clk  0.1  [get_ports {out0[25]}]
set_output_delay -clock clk  0.1  [get_ports {out0[24]}]
set_output_delay -clock clk  0.1  [get_ports {out0[23]}]
set_output_delay -clock clk  0.1  [get_ports {out0[22]}]
set_output_delay -clock clk  0.1  [get_ports {out0[21]}]
set_output_delay -clock clk  0.1  [get_ports {out0[20]}]
set_output_delay -clock clk  0.1  [get_ports {out0[19]}]
set_output_delay -clock clk  0.1  [get_ports {out0[18]}]
set_output_delay -clock clk  0.1  [get_ports {out0[17]}]
set_output_delay -clock clk  0.1  [get_ports {out0[16]}]
set_output_delay -clock clk  0.1  [get_ports {out0[15]}]
set_output_delay -clock clk  0.1  [get_ports {out0[14]}]
set_output_delay -clock clk  0.1  [get_ports {out0[13]}]
set_output_delay -clock clk  0.1  [get_ports {out0[12]}]
set_output_delay -clock clk  0.1  [get_ports {out0[11]}]
set_output_delay -clock clk  0.1  [get_ports {out0[10]}]
set_output_delay -clock clk  0.1  [get_ports {out0[9]}]
set_output_delay -clock clk  0.1  [get_ports {out0[8]}]
set_output_delay -clock clk  0.1  [get_ports {out0[7]}]
set_output_delay -clock clk  0.1  [get_ports {out0[6]}]
set_output_delay -clock clk  0.1  [get_ports {out0[5]}]
set_output_delay -clock clk  0.1  [get_ports {out0[4]}]
set_output_delay -clock clk  0.1  [get_ports {out0[3]}]
set_output_delay -clock clk  0.1  [get_ports {out0[2]}]
set_output_delay -clock clk  0.1  [get_ports {out0[1]}]
set_output_delay -clock clk  0.1  [get_ports {out0[0]}]
